org/2016-09-08-Emacs-As-Daemon.org
#+TITLE: Emacs As Daemon
#+AUTHOR: Yang, Ying-chao
#+EMAIL:  yangyingchao@gmail.com
#+OPTIONS:    ^:nil H:3 num:nil toc:t \n:nil ::t |:t ^:nil -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+STARTUP:    align nodlcheck oddeven lognotestate
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+LANGUAGE:   en
#+EXCLUDE_TAGS: noexport
#+KEYWORDS: (nil)
#+CATEGORY: 未分类
#+DESCRIPTION: (nil)

* Running emacs like a Daemon
:PROPERTIES:
:CUSTOM_ID: h:A1B0BA34-6106-4A82-A74F-F8C7EE0E51C0
:END:

This a new feature that is included in emacs-23.1.

Start the emacs daemon with

#+BEGIN_SRC sh -r
emacs --daemon
#+END_SRC

or,

#+BEGIN_SRC sh -r
sudo emacs --daemon
#+END_SRC


* Simple setup
:PROPERTIES:
:CUSTOM_ID: h:59B63ACE-1ED1-4424-8AF2-31B709332C51
:END:

Put

#+BEGIN_SRC sh -r
export ALTERNATE_EDITOR=""
export EDITOR=emacsclient
#+END_SRC

in your .bashrc, or

#+BEGIN_SRC sh -r
setenv ALTERNATE_EDITOR ""
setenv EDITOR emacsclient
#+END_SRC

in your .cshrc depending on your default shell. After that, using emacsclient (or
emacsclient -t) will automatically start an emacs in daemon mode and connect to it
if one is not found running, and sane programs will know to run emacsclient to
start an editor.

* Debian/Ubuntu
:PROPERTIES:
:CUSTOM_ID: h:7ECF2799-1C91-4DA0-A1F5-E216DFB5AC5E
:END:

Depending on your requirements, there are a couple ways to work with
=emacs --daemon= and =emacsclient=.

** Basic setup
:PROPERTIES:
:CUSTOM_ID: h:86F65E10-C237-4458-AFF5-991FEF4E7B53
:END:
Add =emacs --daemon= to auto-start on boot. This can be done the easy way (via
“Settings > Session and Startup > Application Autostart”) or by writing your own
=.desktop= file and placing it in =~/.config/autostart=.

Then make the following changes to your .bashrc (assuming you’re using bash):

#+BEGIN_SRC sh -r
export ALTERNATE_EDITOR=""
export EDITOR="emacsclient -t"                  # $EDITOR should open in terminal
export VISUAL="emacsclient -c -a emacs"         # $VISUAL opens in GUI with non-daemon as alternate
#+END_SRC

For convenience (and because I’m used to them) I also added the following
aliases:

#+BEGIN_SRC sh -r
alias emax="emacsclient -t"                      # used to be "emacs -nw"
alias semac="sudo emacsclient -t"                # used to be "sudo emacs -nw"
alias emacsc="emacsclient -c -a emacs"           # new - opens the GUI with alternate non-daemon
#+END_SRC

