_posts/2016-09-08-Emacs-As-Daemon.html
---
layout : post
title : Emacs As Daemon
categories : 未分类
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgddedd7f">Running emacs like a Daemon</a></li>
<li><a href="#org9ea0d75">Simple setup</a></li>
<li><a href="#orgd30808c">Debian/Ubuntu</a>
<ul>
<li><a href="#org8e5d651">Basic setup</a></li>
<li><a href="#orgb38546e">Comprehensive init script</a></li>
</ul>
</li>
<li><a href="#org6ad44e3">Gentoo</a></li>
<li><a href="#org6dc28a0">Emacs as Daemon on OS X using Launchd</a></li>
<li><a href="#orgb47f728">Systemd user service on startup</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgddedd7f" class="outline-2">
<h2 id="orgddedd7f">Running emacs like a Daemon</h2>
<div class="outline-text-2" id="text-orgddedd7f">
<p>
This a new feature that is included in emacs-23.1.
</p>

<p>
Start the emacs daemon with
</p>

<div class="org-src-container">
<pre class="src src-sh">emacs --daemon
</pre>
</div>

<p>
or,
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo emacs --daemon
</pre>
</div>
</div>
</div>


<div id="outline-container-org9ea0d75" class="outline-2">
<h2 id="org9ea0d75">Simple setup</h2>
<div class="outline-text-2" id="text-org9ea0d75">
<p>
Put
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #32cd32;">export</span> <span style="color: #daa520;">ALTERNATE_EDITOR</span>=<span style="color: #d78700;">""</span>
<span style="color: #32cd32;">export</span> <span style="color: #daa520;">EDITOR</span>=emacsclient
</pre>
</div>

<p>
in your .bashrc, or
</p>

<div class="org-src-container">
<pre class="src src-sh">setenv ALTERNATE_EDITOR <span style="color: #d78700;">""</span>
setenv EDITOR emacsclient
</pre>
</div>

<p>
in your .cshrc depending on your default shell. After that, using emacsclient (or
emacsclient -t) will automatically start an emacs in daemon mode and connect to it
if one is not found running, and sane programs will know to run emacsclient to
start an editor.
</p>
</div>
</div>

<div id="outline-container-orgd30808c" class="outline-2">
<h2 id="orgd30808c">Debian/Ubuntu</h2>
<div class="outline-text-2" id="text-orgd30808c">
<p>
Depending on your requirements, there are a couple ways to work with
<code>emacs --daemon</code> and <code>emacsclient</code>.
</p>
</div>

<div id="outline-container-org8e5d651" class="outline-3">
<h3 id="org8e5d651">Basic setup</h3>
<div class="outline-text-3" id="text-org8e5d651">
<p>
Add <code>emacs --daemon</code> to auto-start on boot. This can be done the easy way (via
“Settings &gt; Session and Startup &gt; Application Autostart”) or by writing your own
<code>.desktop</code> file and placing it in <code>~/.config/autostart</code>.
</p>

<p>
Then make the following changes to your .bashrc (assuming you’re using bash):
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #32cd32;">export</span> <span style="color: #daa520;">ALTERNATE_EDITOR</span>=<span style="color: #d78700;">""</span>
<span style="color: #32cd32;">export</span> <span style="color: #daa520;">EDITOR</span>=<span style="color: #d78700;">"emacsclient -t"</span>                  <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">$EDITOR should open in terminal</span>
<span style="color: #32cd32;">export</span> <span style="color: #daa520;">VISUAL</span>=<span style="color: #d78700;">"emacsclient -c -a emacs"</span>         <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">$VISUAL opens in GUI with non-daemon as alternate</span>
</pre>
</div>

<p>
For convenience (and because I’m used to them) I also added the following
aliases:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #32cd32;">alias</span> <span style="color: #daa520;">emax</span>=<span style="color: #d78700;">"emacsclient -t"</span>                      <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">used to be "emacs -nw"</span>
<span style="color: #32cd32;">alias</span> <span style="color: #daa520;">semac</span>=<span style="color: #d78700;">"sudo emacsclient -t"</span>                <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">used to be "sudo emacs -nw"</span>
<span style="color: #32cd32;">alias</span> <span style="color: #daa520;">emacsc</span>=<span style="color: #d78700;">"emacsclient -c -a emacs"</span>           <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">new - opens the GUI with alternate non-daemon</span>
</pre>
</div>
</div>
</div>
