org/2016-09-08-Emacs-As-Daemon.org
** Comprehensive init script
:PROPERTIES:
:CUSTOM_ID: h:51BA0D97-731A-4F26-AF4C-431EC301B701
:END:
Here a little init script for GNU Debian/Ubuntu (please help to improve!) Save in
/etc/init.d/emacs

#+BEGIN_SRC sh -r
  #! /bin/sh
  ### BEGIN INIT INFO
  # Provides:          emacs
  # Default-Start:     2 3 4 5
  # Default-Stop:      S 0 1 6
  # Description:       This file should be placed in /etc/init.d.
  ### END INIT INFO

  #change this
  USERNAME=YourUserName
  eval USERHOME=~$USERNAME
  DESC="Run the emacs daemon."
  NAME=emacs
  #change this
  DAEMON=/opt/emacs23/bin/$NAME
  DAEMON_ARGS="--daemon"
  PIDFILE=/var/run/$NAME.pid
  SCRIPTNAME=/etc/init.d/$NAME
  #change this
  EMACSCLIENT=/opt/emacs23/bin/emacsclient
  EVALEXIT="(progn (kill-emacs))"

  # Exit if the package is not installed
  [ -x "$DAEMON" ] || exit 0

  # Read configuration variable file if it is present
  [ -r /etc/default/$NAME ] && . /etc/default/$NAME

  # Load the VERBOSE setting and other rcS variables
  [ -f /etc/default/rcS ] && . /etc/default/rcS

  # Define LSB log_* functions.
  # Depend on lsb-base (>= 3.0-6) to ensure that this file is present.
  . /lib/lsb/init-functions

  #
  # Function that starts the daemon/service
  #
  do_start()
  {
      # Return
      #   0 if daemon has been started
      #   1 if daemon was already running
      #   2 if daemon could not be started
      start-stop-daemon -c $USERNAME -d $USERHOME --start --quiet --pidfile $PIDFILE --exec $DAEMON --test > /dev/null \
          || return 1
      start-stop-daemon -c $USERNAME -d $USERHOME --start --quiet --pidfile $PIDFILE --exec $DAEMON -- \
          $DAEMON_ARGS \
          || return 2
      # Add code here, if necessary, that waits for the process to be ready
      # to handle requests from services started subsequently which depend
      # on this one.  As a last resort, sleep for some time.
  }

  #
  # Function that stops the daemon/service
  #
  do_stop()
  {
          $EMACSCLIENT --eval "$EVALEXIT"
      # Return
      #   0 if daemon has been stopped
      #   1 if daemon was already stopped
      #   2 if daemon could not be stopped
      #   other if a failure occurred
      start-stop-daemon --stop --quiet --retry=TERM/30/KILL/5 --pidfile $PIDFILE --name $NAME
      RETVAL="$?"
      [ "$RETVAL" = 2 ] && return 2
      # Wait for children to finish too if this is a daemon that forks
      # and if the daemon is only ever run from this initscript.
      # If the above conditions are not satisfied then add some other code
      # that waits for the process to drop all resources that could be
      # needed by services started subsequently.  A last resort is to
      # sleep for some time.
      start-stop-daemon --stop --quiet --oknodo --retry=0/30/KILL/5 --exec $DAEMON
      [ "$?" = 2 ] && return 2
      # Many daemons don't delete their pidfiles when they exit.
      rm -f $PIDFILE
      return "$RETVAL"
  }

  #
  # Function that sends a SIGHUP to the daemon/service
  #
  do_reload() {
      #
      # If the daemon can reload its configuration without
      # restarting (for example, when it is sent a SIGHUP),
      # then implement that here.
      #
      start-stop-daemon --stop --signal 1 --quiet --pidfile $PIDFILE --name $NAME
      return 0
  }

  case "$1" in
    start)
      [ "$VERBOSE" != no ] && log_daemon_msg "Starting $DESC" "$NAME"
      do_start
      case "$?" in
          0|1) [ "$VERBOSE" != no ] && log_end_msg 0 ;;
          2) [ "$VERBOSE" != no ] && log_end_msg 1 ;;
      esac
      ;;
    stop)
      [ "$VERBOSE" != no ] && log_daemon_msg "Stopping $DESC" "$NAME"
      do_stop
      case "$?" in
          0|1) [ "$VERBOSE" != no ] && log_end_msg 0 ;;
          2) [ "$VERBOSE" != no ] && log_end_msg 1 ;;
      esac
      ;;
    #reload|force-reload)
      #
      # If do_reload() is not implemented then leave this commented out
      # and leave 'force-reload' as an alias for 'restart'.
      #
      #log_daemon_msg "Reloading $DESC" "$NAME"
      #do_reload
      #log_end_msg $?
      #;;
    restart|force-reload)
      #
      # If the "reload" option is implemented then remove the
      # 'force-reload' alias
      #
      log_daemon_msg "Restarting $DESC" "$NAME"
      do_stop
      case "$?" in
        0|1)
          do_start
          case "$?" in
              0) log_end_msg 0 ;;
              1) log_end_msg 1 ;; # Old process is still running
              ,*) log_end_msg 1 ;; # Failed to start
          esac
          ;;
        ,*)
          # Failed to stop
          log_end_msg 1
          ;;
      esac
      ;;
    ,*)
      #echo "Usage: $SCRIPTNAME {start|stop|restart|reload|force-reload}" >&2
      echo "Usage: $SCRIPTNAME {start|stop|restart|force-reload}" >&2
      exit 3
      ;;
  esac

  :
#+END_SRC

I use also this start script placed in /usr/bin/emacs

#+BEGIN_SRC sh -r
#!/bin/bash
USERID=`id -u`
if [ ! -e /tmp/emacs$USERID/server ]
then
	echo "Starting server."
	/etc/init.d/emacs start
        while [ ! -e "/tmp/emacs$USERID/server" ] ; do sleep 1 ; done
fi

emacsclient -c "$@"
#+END_SRC

bug : unfortunately this does not work on Debian Lenny using sudo. I get:

#+BEGIN_SRC console -r
start-stop-daemon: Unable to chdir() to /home/root/ (No such file or directory)
#+END_SRC

*Fixed* : replaced =home/$USERNAME= with =~$USERNAME= (root’s home directory is
/root not in /home)

Since start-stop-daemon needs root should they be sudo calls? Otherwise surely on
root can run emacs in this way!

- This init script requires you to change the USERNAME variable - not ideal :/
- How do you think deal with the choose of a user? One server per user? I think its a bad idea. The server is not useful for all users.
- How about starting a server for every user in group ‘emacs’ or ‘emacs-daemon’?

You should rather change the variables in /etc/default/emacs, this is how other init scripts work. You could extend the script to start daemons for several users, e.g. by looking for a .start-emacs-daemon file in their home directories. But then, the init script wouldn’t make much sense on a system with multiple users, anyway: such a computer should never get powered off, so the init script will not run, anyway. A better solution would be to start the daemon lazily: just create a wrapper around emacsclient, starting the daemon if it isn’t already running. – AnselmHelbig

