_posts/2016-09-08-Emacs-As-Daemon.html

<div id="outline-container-orgb38546e" class="outline-3">
<h3 id="orgb38546e">Comprehensive init script</h3>
<div class="outline-text-3" id="text-orgb38546e">
<p>
Here a little init script for GNU Debian/Ubuntu (please help to improve!) Save in
/etc/init.d/emacs
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">! /bin/</span><span style="color: #ff4040;">sh</span>
<span style="color: #cd5c5c; font-style: italic;">### </span><span style="color: #cd5c5c; font-style: italic;">BEGIN INIT INFO</span>
<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Provides:          emacs</span>
<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Default-Start:     2 3 4 5</span>
<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Default-Stop:      S 0 1 6</span>
<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Description:       This file should be placed in /etc/init.d.</span>
<span style="color: #cd5c5c; font-style: italic;">### </span><span style="color: #cd5c5c; font-style: italic;">END INIT INFO</span>

<span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">change this</span>
<span style="color: #daa520;">USERNAME</span>=YourUserName
<span style="color: #32cd32;">eval</span> <span style="color: #daa520;">USERHOME</span>=~$<span style="color: #daa520;">USERNAME</span>
<span style="color: #daa520;">DESC</span>=<span style="color: #d78700;">"Run the emacs daemon."</span>
<span style="color: #daa520;">NAME</span>=emacs
<span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">change this</span>
<span style="color: #daa520;">DAEMON</span>=/opt/emacs23/bin/$<span style="color: #daa520;">NAME</span>
<span style="color: #daa520;">DAEMON_ARGS</span>=<span style="color: #d78700;">"--daemon"</span>
<span style="color: #daa520;">PIDFILE</span>=/var/run/$<span style="color: #daa520;">NAME</span>.pid
<span style="color: #daa520;">SCRIPTNAME</span>=/etc/init.d/$<span style="color: #daa520;">NAME</span>
<span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">change this</span>
<span style="color: #daa520;">EMACSCLIENT</span>=/opt/emacs23/bin/emacsclient
<span style="color: #daa520;">EVALEXIT</span>=<span style="color: #d78700;">"(progn (kill-emacs))"</span>

<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Exit if the package is not installed</span>
[ -x <span style="color: #d78700;">"$DAEMON"</span> ] || <span style="color: #ff4040;">exit</span> 0

<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Read configuration variable file if it is present</span>
[ -r /etc/default/$<span style="color: #daa520;">NAME</span> ] &amp;&amp; <span style="color: #32cd32;">.</span> /etc/default/$<span style="color: #daa520;">NAME</span>

<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Load the VERBOSE setting and other rcS variables</span>
[ -f /etc/default/rcS ] &amp;&amp; <span style="color: #32cd32;">.</span> /etc/default/rcS

<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Define LSB log_* functions.</span>
<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Depend on lsb-base (&gt;= 3.0-6) to ensure that this file is present.</span>
<span style="color: #32cd32;">.</span> /lib/lsb/init-functions

<span style="color: #cd5c5c; font-style: italic;">#</span>
<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Function that starts the daemon/service</span>
<span style="color: #cd5c5c; font-style: italic;">#</span>
<span style="color: #1e90ff; font-weight: bold;">do_start</span>()
{
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Return</span>
    <span style="color: #cd5c5c; font-style: italic;">#   </span><span style="color: #cd5c5c; font-style: italic;">0 if daemon has been started</span>
    <span style="color: #cd5c5c; font-style: italic;">#   </span><span style="color: #cd5c5c; font-style: italic;">1 if daemon was already running</span>
    <span style="color: #cd5c5c; font-style: italic;">#   </span><span style="color: #cd5c5c; font-style: italic;">2 if daemon could not be started</span>
    start-stop-daemon -c $<span style="color: #daa520;">USERNAME</span> -d $<span style="color: #daa520;">USERHOME</span> --start --quiet --pidfile $<span style="color: #daa520;">PIDFILE</span> --exec $<span style="color: #daa520;">DAEMON</span> --test &gt; /dev/null <span style="color: #d78700;">\</span>
        || <span style="color: #ff4040;">return</span> 1
    start-stop-daemon -c $<span style="color: #daa520;">USERNAME</span> -d $<span style="color: #daa520;">USERHOME</span> --start --quiet --pidfile $<span style="color: #daa520;">PIDFILE</span> --exec $<span style="color: #daa520;">DAEMON</span> -- <span style="color: #d78700;">\</span>
        $<span style="color: #daa520;">DAEMON_ARGS</span> <span style="color: #d78700;">\</span>
        || <span style="color: #ff4040;">return</span> 2
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Add code here, if necessary, that waits for the process to be ready</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">to handle requests from services started subsequently which depend</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">on this one.  As a last resort, sleep for some time.</span>
}

<span style="color: #cd5c5c; font-style: italic;">#</span>
<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Function that stops the daemon/service</span>
<span style="color: #cd5c5c; font-style: italic;">#</span>
<span style="color: #1e90ff; font-weight: bold;">do_stop</span>()
{
        $<span style="color: #daa520;">EMACSCLIENT</span> --eval <span style="color: #d78700;">"$EVALEXIT"</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Return</span>
    <span style="color: #cd5c5c; font-style: italic;">#   </span><span style="color: #cd5c5c; font-style: italic;">0 if daemon has been stopped</span>
    <span style="color: #cd5c5c; font-style: italic;">#   </span><span style="color: #cd5c5c; font-style: italic;">1 if daemon was already stopped</span>
    <span style="color: #cd5c5c; font-style: italic;">#   </span><span style="color: #cd5c5c; font-style: italic;">2 if daemon could not be stopped</span>
    <span style="color: #cd5c5c; font-style: italic;">#   </span><span style="color: #cd5c5c; font-style: italic;">other if a failure occurred</span>
    start-stop-daemon --stop --quiet --retry=TERM/30/KILL/5 --pidfile $<span style="color: #daa520;">PIDFILE</span> --name $<span style="color: #daa520;">NAME</span>
    <span style="color: #daa520;">RETVAL</span>=<span style="color: #d78700;">"$?"</span>
    [ <span style="color: #d78700;">"$RETVAL"</span> = 2 ] &amp;&amp; <span style="color: #ff4040;">return</span> 2
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Wait for children to finish too if this is a daemon that forks</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">and if the daemon is only ever run from this initscript.</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">If the above conditions are not satisfied then add some other code</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">that waits for the process to drop all resources that could be</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">needed by services started subsequently.  A last resort is to</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">sleep for some time.</span>
    start-stop-daemon --stop --quiet --oknodo --retry=0/30/KILL/5 --exec $<span style="color: #daa520;">DAEMON</span>
    [ <span style="color: #d78700;">"$?"</span> = 2 ] &amp;&amp; <span style="color: #ff4040;">return</span> 2
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Many daemons don't delete their pidfiles when they exit.</span>
    rm -f $<span style="color: #daa520;">PIDFILE</span>
    <span style="color: #ff4040;">return</span> <span style="color: #d78700;">"$RETVAL"</span>
}

<span style="color: #cd5c5c; font-style: italic;">#</span>
<span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Function that sends a SIGHUP to the daemon/service</span>
<span style="color: #cd5c5c; font-style: italic;">#</span>
<span style="color: #1e90ff; font-weight: bold;">do_reload</span>() {
    <span style="color: #cd5c5c; font-style: italic;">#</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">If the daemon can reload its configuration without</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">restarting (for example, when it is sent a SIGHUP),</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">then implement that here.</span>
    <span style="color: #cd5c5c; font-style: italic;">#</span>
    start-stop-daemon --stop --signal 1 --quiet --pidfile $<span style="color: #daa520;">PIDFILE</span> --name $<span style="color: #daa520;">NAME</span>
    <span style="color: #ff4040;">return</span> 0
}

<span style="color: #ff4040;">case</span> <span style="color: #d78700;">"$1"</span><span style="color: #ff4040;"> in</span>
  start)
    [ <span style="color: #d78700;">"$VERBOSE"</span> != no ] &amp;&amp; log_daemon_msg <span style="color: #d78700;">"Starting $DESC"</span> <span style="color: #d78700;">"$NAME"</span>
    do_start
    <span style="color: #ff4040;">case</span> <span style="color: #d78700;">"$?"</span><span style="color: #ff4040;"> in</span>
        0|1) [ <span style="color: #d78700;">"$VERBOSE"</span> != no ] &amp;&amp; log_end_msg 0 ;;
        2) [ <span style="color: #d78700;">"$VERBOSE"</span> != no ] &amp;&amp; log_end_msg 1 ;;
    <span style="color: #ff4040;">esac</span>
    ;;
  stop)
    [ <span style="color: #d78700;">"$VERBOSE"</span> != no ] &amp;&amp; log_daemon_msg <span style="color: #d78700;">"Stopping $DESC"</span> <span style="color: #d78700;">"$NAME"</span>
    do_stop
    <span style="color: #ff4040;">case</span> <span style="color: #d78700;">"$?"</span><span style="color: #ff4040;"> in</span>
        0|1) [ <span style="color: #d78700;">"$VERBOSE"</span> != no ] &amp;&amp; log_end_msg 0 ;;
        2) [ <span style="color: #d78700;">"$VERBOSE"</span> != no ] &amp;&amp; log_end_msg 1 ;;
    <span style="color: #ff4040;">esac</span>
    ;;
  <span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">reload|force-reload)</span>
    <span style="color: #cd5c5c; font-style: italic;">#</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">If do_reload() is not implemented then leave this commented out</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">and leave 'force-reload' as an alias for 'restart'.</span>
    <span style="color: #cd5c5c; font-style: italic;">#</span>
    <span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">log_daemon_msg "Reloading $DESC" "$NAME"</span>
    <span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">do_reload</span>
    <span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">log_end_msg $?</span>
    <span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">;;</span>
  restart|force-reload)
    <span style="color: #cd5c5c; font-style: italic;">#</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">If the "reload" option is implemented then remove the</span>
    <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">'force-reload' alias</span>
    <span style="color: #cd5c5c; font-style: italic;">#</span>
    log_daemon_msg <span style="color: #d78700;">"Restarting $DESC"</span> <span style="color: #d78700;">"$NAME"</span>
    do_stop
    <span style="color: #ff4040;">case</span> <span style="color: #d78700;">"$?"</span><span style="color: #ff4040;"> in</span>
      0|1)
        do_start
        <span style="color: #ff4040;">case</span> <span style="color: #d78700;">"$?"</span><span style="color: #ff4040;"> in</span>
            0) log_end_msg 0 ;;
            1) log_end_msg 1 ;; <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Old process is still running</span>
            *) log_end_msg 1 ;; <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Failed to start</span>
        <span style="color: #ff4040;">esac</span>
        ;;
      *)
        <span style="color: #cd5c5c; font-style: italic;"># </span><span style="color: #cd5c5c; font-style: italic;">Failed to stop</span>
        log_end_msg 1
        ;;
    <span style="color: #ff4040;">esac</span>
    ;;
  *)
    <span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">echo "Usage: $SCRIPTNAME {start|stop|restart|reload|force-reload}" &gt;&amp;2</span>
    <span style="color: #32cd32;">echo</span> <span style="color: #d78700;">"Usage: $SCRIPTNAME {start|stop|restart|force-reload}"</span> &gt;&amp;2
    <span style="color: #ff4040;">exit</span> 3
    ;;
<span style="color: #ff4040;">esac</span>

:
</pre>
</div>

<p>
I use also this start script placed in /usr/bin/emacs
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cd5c5c; font-style: italic;">#</span><span style="color: #cd5c5c; font-style: italic;">!/bin/</span><span style="color: #ff4040;">bash</span>
<span style="color: #daa520;">USERID</span>=<span style="color: #fa8072;">`id -u`</span>
<span style="color: #ff4040;">if</span> [ ! -e /tmp/emacs$<span style="color: #daa520;">USERID</span>/server ]
<span style="color: #ff4040;">then</span>
    <span style="color: #32cd32;">echo</span> <span style="color: #d78700;">"Starting server."</span>
    /etc/init.d/emacs start
        <span style="color: #ff4040;">while</span> [ ! -e <span style="color: #d78700;">"/tmp/emacs$USERID/server"</span> ] ; <span style="color: #ff4040;">do</span> sleep 1 ; <span style="color: #ff4040;">done</span>
<span style="color: #ff4040;">fi</span>

emacsclient -c <span style="color: #d78700;">"$@"</span>
</pre>
</div>

<p>
bug : unfortunately this does not work on Debian Lenny using sudo. I get:
</p>

<div class="org-src-container">
<pre class="src src-console">start-stop-daemon: Unable to chdir() to /home/root/ (No such file or directory)
</pre>
</div>

<p>
<b>Fixed</b> : replaced <code>home/$USERNAME</code> with <code>~$USERNAME</code> (root’s home directory is
/root not in /home)
</p>

<p>
Since start-stop-daemon needs root should they be sudo calls? Otherwise surely on
root can run emacs in this way!
</p>

<ul class="org-ul">
<li>This init script requires you to change the USERNAME variable - not ideal :/</li>
<li>How do you think deal with the choose of a user? One server per user? I think its a bad idea. The server is not useful for all users.</li>
<li>How about starting a server for every user in group ‘emacs’ or ‘emacs-daemon’?</li>
</ul>

<p>
You should rather change the variables in /etc/default/emacs, this is how other init scripts work. You could extend the script to start daemons for several users, e.g. by looking for a .start-emacs-daemon file in their home directories. But then, the init script wouldn’t make much sense on a system with multiple users, anyway: such a computer should never get powered off, so the init script will not run, anyway. A better solution would be to start the daemon lazily: just create a wrapper around emacsclient, starting the daemon if it isn’t already running. – AnselmHelbig
</p>
</div>
</div>
</div>
