org/2016-09-08-Emacs-As-Daemon.org
* Gentoo
:PROPERTIES:
:CUSTOM_ID: h:5422C071-751D-4A45-B946-1882A4EF46CD
:END:

Gentoo includes support for running Emacs as a daemon in the
=app-emacs/emacs-daemon= package.

#+BEGIN_SRC sh -r
emerge app-emacs/emacs-daemon
#+END_SRC

Every user who wants to connect to an Emacs server must have an own instance of
the daemonized Emacs. The init script automatically determines the user by its
name, so you create a symbolic link (do not copy the script, or you will miss
eventual updates!) in your /etc/init.d directory:

#+BEGIN_SRC sh -r
ln -s emacs /etc/init.d/emacs.username
#+END_SRC

This may be added to the boot sequence (and will run under the user’s privileges)

#+BEGIN_SRC sh -r
rc-update add emacs.username default
#+END_SRC

Further customizations can be done through the /etc/conf.d/emacs file, which is
extensively commented. You may also create individual /etc/conf.d/emacs.username
files for “multiplexed” user configuration.

* Emacs as Daemon on OS X using Launchd
:PROPERTIES:
:CUSTOM_ID: h:7E736866-C83E-4146-A286-F05F5E55D58D
:END:

If you’re running Emacs 23, you can run Emacs As Daemon via OS X’s launchd. The
easiest solution is to use a tool like Lingon to create the plist file or can
create one manually like this:

#+BEGIN_SRC nxml -r
  <?xml version="1.0" encoding="utf-8"?>
  <?xml version="1.0" encoding="UTF-8"?>
  <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
      "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
   <plist version="1.0">
    <dict>
      <key>Label</key>
      <string>gnu.emacs.daemon</string>
      <key>ProgramArguments</key>
      <array>
        <string>/Applications/Emacs.app/Contents/MacOS/Emacs</string>
        <string>--daemon</string>
      </array>
     <key>RunAtLoad</key>
     <true/>
     <key>ServiceDescription</key>
     <string>Gnu Emacs Daemon</string>
     <key>UserName</key>
     <string>[YOUR USERNAME HERE]</string>
    </dict>
  </plist>
#+END_SRC

This can then be installed in =/Library/LaunchAgents= and loaded via:

#+BEGIN_SRC sh -r
  sudo launchctl load -w /Library/LaunchAgents/gnu.emacs.daemon.plist
#+END_SRC

* Systemd user service on startup
:PROPERTIES:
:CUSTOM_ID: h:AE7BAF15-18A1-48E9-95C2-771B13420695
:END:

It’s simple enough to run the emacs daemon with systemd.

#+BEGIN_SRC console -r
$ cat ~/.config/systemd/user/emacs.service
[Unit]
Description=Emacs: the extensible, self-documenting text editor

[Service]
Type=forking
ExecStart=/usr/bin/emacs --daemon
ExecStop=/usr/bin/emacsclient --eval "(kill-emacs)"
Environment=SSH_AUTH_SOCK=%t/keyring/ssh
Restart=always

[Install]
WantedBy=default.target
#+END_SRC

Make sure the =SSH_AUTH_SOCK= is the correct one by checking the output of the following:

#+BEGIN_SRC console -r
$ echo $SSH_AUTH_SOCK
/run/user/1000/keyring/ssh
#+END_SRC

When you see %t in the emacs.service file, it means the value of =XDG_RUNTIME_DIR=
(which equals to =/run/user/1000= on my computer).

Enable the unit for your user

#+BEGIN_SRC sh -r
systemctl enable --user emacs
systemctl start --user emacs
#+END_SRC

