_posts/2016-09-08-Emacs-As-Daemon.html

<div id="outline-container-org6ad44e3" class="outline-2">
<h2 id="org6ad44e3">Gentoo</h2>
<div class="outline-text-2" id="text-org6ad44e3">
<p>
Gentoo includes support for running Emacs as a daemon in the
<code>app-emacs/emacs-daemon</code> package.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #32cd32;">emerge</span> app-emacs/emacs-daemon
</pre>
</div>

<p>
Every user who wants to connect to an Emacs server must have an own instance of
the daemonized Emacs. The init script automatically determines the user by its
name, so you create a symbolic link (do not copy the script, or you will miss
eventual updates!) in your /etc/init.d directory:
</p>

<div class="org-src-container">
<pre class="src src-sh">ln -s emacs /etc/init.d/emacs.username
</pre>
</div>

<p>
This may be added to the boot sequence (and will run under the user’s privileges)
</p>

<div class="org-src-container">
<pre class="src src-sh">rc-update add emacs.username default
</pre>
</div>

<p>
Further customizations can be done through the /etc/conf.d/emacs file, which is
extensively commented. You may also create individual /etc/conf.d/emacs.username
files for “multiplexed” user configuration.
</p>
</div>
</div>

<div id="outline-container-org6dc28a0" class="outline-2">
<h2 id="org6dc28a0">Emacs as Daemon on OS X using Launchd</h2>
<div class="outline-text-2" id="text-org6dc28a0">
<p>
If you’re running Emacs 23, you can run Emacs As Daemon via OS X’s launchd. The
easiest solution is to use a tool like Lingon to create the plist file or can
create one manually like this:
</p>

<div class="org-src-container">
<pre class="src src-nxml"><span style="color: #d78700;">&lt;?</span><span style="color: #ff4040;">xml</span><span style="color: #d78700;"> </span><span style="color: #87ceeb;">version="1.0" encoding="utf-8"</span><span style="color: #d78700;">?&gt;</span>
<span style="color: #d78700;">&lt;?</span><span style="color: #ff4040;">xml</span><span style="color: #d78700;"> </span><span style="color: #87ceeb;">version="1.0" encoding="utf-8"</span><span style="color: #d78700;">?&gt;</span>
<span style="color: #d78700;">&lt;?</span><span style="color: #ff4040;">xml</span><span style="color: #d78700;"> </span><span style="color: #87ceeb;">version="1.0" encoding="UTF-8"</span><span style="color: #d78700;">?&gt;</span>
<span style="color: #d78700;">&lt;!</span><span style="color: #d78700;">DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"</span>
<span style="color: #d78700;">    "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;</span>
 &lt;<span style="color: #1e90ff; font-weight: bold;">plist</span> <span style="color: #daa520;">version</span>=<span style="color: #d78700;">"1.0"</span>&gt;
  &lt;<span style="color: #1e90ff; font-weight: bold;">dict</span>&gt;
    &lt;<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;Label&lt;/<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;
    &lt;<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;gnu.emacs.daemon&lt;/<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;
    &lt;<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;ProgramArguments&lt;/<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;
    &lt;<span style="color: #1e90ff; font-weight: bold;">array</span>&gt;
      &lt;<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;/Applications/Emacs.app/Contents/MacOS/Emacs&lt;/<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;
      &lt;<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;--daemon&lt;/<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;
    &lt;/<span style="color: #1e90ff; font-weight: bold;">array</span>&gt;
   &lt;<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;RunAtLoad&lt;/<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;
   &lt;<span style="color: #1e90ff; font-weight: bold;">true</span>/&gt;
   &lt;<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;ServiceDescription&lt;/<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;
   &lt;<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;Gnu Emacs Daemon&lt;/<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;
   &lt;<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;UserName&lt;/<span style="color: #1e90ff; font-weight: bold;">key</span>&gt;
   &lt;<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;[YOUR USERNAME HERE]&lt;/<span style="color: #1e90ff; font-weight: bold;">string</span>&gt;
  &lt;/<span style="color: #1e90ff; font-weight: bold;">dict</span>&gt;
&lt;/<span style="color: #1e90ff; font-weight: bold;">plist</span>&gt;
</pre>
</div>

<p>
This can then be installed in <code>/Library/LaunchAgents</code> and loaded via:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo launchctl load -w /Library/LaunchAgents/gnu.emacs.daemon.plist
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb47f728" class="outline-2">
<h2 id="orgb47f728">Systemd user service on startup</h2>
<div class="outline-text-2" id="text-orgb47f728">
<p>
It’s simple enough to run the emacs daemon with systemd.
</p>

<div class="org-src-container">
<pre class="src src-console">$ cat ~/.config/systemd/user/emacs.service
[Unit]
Description=Emacs: the extensible, self-documenting text editor

[Service]
Type=forking
ExecStart=/usr/bin/emacs --daemon
ExecStop=/usr/bin/emacsclient --eval <span style="color: #d78700;">"(kill-emacs)"</span>
Environment=SSH_AUTH_SOCK=%t/keyring/ssh
Restart=always

[Install]
WantedBy=default.target
</pre>
</div>

<p>
Make sure the <code>SSH_AUTH_SOCK</code> is the correct one by checking the output of the following:
</p>

<div class="org-src-container">
<pre class="src src-console">$ echo $SSH_AUTH_SOCK
/run/user/1000/keyring/ssh
</pre>
</div>

<p>
When you see %t in the emacs.service file, it means the value of <code>XDG_RUNTIME_DIR</code>
(which equals to <code>/run/user/1000</code> on my computer).
</p>

<p>
Enable the unit for your user
</p>

<div class="org-src-container">
<pre class="src src-sh">systemctl enable --user emacs
systemctl start --user emacs
</pre>
</div>
</div>
</div>
